package students.jelena_albova.lesson_2.level_1.task_1.level_2;

public class Task7LoginService {
    public static void main(String[] args) {
        System.out.println("You can login!");

    }


}


    /*Дан код, нужно сделать этот код запускаемым.
        Для сдачи работы создайте исправленный класс.

class LoginService {

    public void main(String[] args) {
        System.out.println("You can login!");
    } */