package students.jelena_albova.lesson_2.level_1.task_1.level_2;

public class Task8 {
    public static void main(String[] args) {

        java.util.Scanner scan = new java.util.Scanner(System.in);

        System.out.println("Введите имя пользователя: ");
        String username = scan.nextLine();
        System.out.println("Hello, " + username);



    }


}



   /* Написать консольную программу, которая запрашивает
        имя пользователя и выводит на консоль текст:
        Hello имя пользователя!*/